{
  "domande_aperte": [
    {
      "id": 1,
      "domanda": "Cos'è la memoria cache?"
    },
    {
      "id": 2,
      "domanda": "Cos'è un FQDN? Dove lo troviamo?"
    },
    {
      "id": 3,
      "domanda": "Cosa sono i vincoli di colonna in una relazione?"
    }
  ],
  "testi": [
    {
      "id": 1,
      "titolo": "Cos'è un computer?",
      "testo": "Il computer è una macchina che esegue operazioni e calcoli automaticamente, seguendo le istruzioni che gli vengono date. Esistono diversi tipi di computer, come i computer portatili, i desktop e i server. I computer sono composti da due parti principali: l'hardware e il software. L'hardware include tutte le componenti fisiche, come il processore, la memoria e il disco rigido, mentre il software include i programmi e i sistemi operativi che gestiscono l'hardware e le applicazioni. Il sistema operativo più comune è Windows, ma ci sono anche altri come macOS e Linux.",
      "domande_multipla": [
        {
          "domanda": "Che cos'è un computer?",
          "opzioni": [
            "Una macchina che esegue calcoli e operazioni",
            "Un tipo di software",
            "Una macchina che può solo navigare su Internet",
            "Un dispositivo che memorizza dati"
          ]
        },
        {
          "domanda": "Quale di queste è una parte dell'hardware di un computer?",
          "opzioni": [
            "Windows",
            "Processore",
            "Browser",
            "Programmi"
          ]
        },
        {
          "domanda": "Qual è il sistema operativo più comune?",
          "opzioni": [
            "Linux",
            "macOS",
            "Windows",
            "Android"
          ]
        },
        {
          "domanda": "Cosa fa il sistema operativo di un computer?",
          "opzioni": [
            "Gestisce solo le applicazioni",
            "Gestisce l'hardware e i programmi",
            "Esegue solo giochi",
            "Memorizza i dati"
          ]
        },
        {
          "domanda": "Quale di questi è un tipo di computer?",
          "opzioni": [
            "Desktop",
            "Lampada",
            "Frigorifero",
            "Orologio"
          ]
        }
      ]
    },
    {
      "id": 2,
      "titolo": "La Rete Internet",
      "testo": "Internet è una rete mondiale di computer che sono connessi tra loro. Grazie a Internet, le persone possono scambiarsi informazioni, comunicare e accedere a contenuti come video, musica, articoli e molto altro. Ogni dispositivo connesso a Internet è identificato da un indirizzo IP, che è un numero unico. I siti web sono accessibili tramite dei nomi di dominio, che corrispondono agli indirizzi IP, ma sono più facili da ricordare. Il browser è il programma che permette di navigare su Internet, e i più popolari sono Google Chrome, Mozilla Firefox e Safari. Oltre alla navigazione, Internet consente anche di utilizzare servizi come la posta elettronica e la messaggistica istantanea.",
      "domande_multipla": [
        {
          "domanda": "Cos'è Internet?",
          "opzioni": [
            "Una rete di computer connessi tra loro",
            "Un tipo di software",
            "Un sistema operativo",
            "Una macchina per calcoli"
          ]
        },
        {
          "domanda": "Come sono identificati i dispositivi connessi a Internet?",
          "opzioni": [
            "Con un nome utente",
            "Con un indirizzo IP",
            "Con un codice di sicurezza",
            "Con un codice a barre"
          ]
        },
        {
          "domanda": "Cosa fa un browser?",
          "opzioni": [
            "Gestisce l'hardware del computer",
            "Permette di navigare su Internet",
            "Memorizza i dati",
            "Protegge il computer dai virus"
          ]
        },
        {
          "domanda": "Quale dei seguenti è un esempio di browser?",
          "opzioni": [
            "Google Chrome",
            "Microsoft Word",
            "Adobe Photoshop",
            "Spotify"
          ]
        },
        {
          "domanda": "Cos'è un nome di dominio?",
          "opzioni": [
            "Un numero che identifica un sito web",
            "Un indirizzo IP",
            "Un nome facile da ricordare per accedere a un sito web",
            "Un programma per inviare email"
          ]
        }
      ]
    }
  ]
}
